test/stress-test-report.txt
This is ApacheBench, Version 2.3 <$Revision: 1430300 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking mmoo.fun (be patient).....done


Server Software:        
Server Hostname:        mmoo.fun
Server Port:            80

Document Path:          /
Document Length:        3734 bytes

Concurrency Level:      10
Time taken for tests:   3.880 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      383400 bytes
HTML transferred:       373400 bytes
Requests per second:    25.77 [#/sec] (mean)
Time per request:       388.043 [ms] (mean)
Time per request:       38.804 [ms] (mean, across all concurrent requests)
Transfer rate:          96.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   20 140.9      0    1002
Processing:     1  259 511.1      7    3039
Waiting:        1  223 476.9      7    3038
Total:          1  280 520.3      7    3039

Percentage of the requests served within a certain time (ms)
  50%      7
  66%    204
  75%    209
  80%    606
  90%   1006
  95%   1423
  98%   2028
  99%   3039
 100%   3039 (longest request)